no1exam/frontend/modules/customer/models/Customer.php

UPDATE `customers` SET `id`='7', `password`='$2y$13$URx672zhUtHA4K5Rgq1iquwHHmalF3GtZ8F5gUON.g8Mcn4QwwrRq' WHERE `id`='7'
---
    public static function updateCustomer($arrInputs, $arrWhere)
    {
        $objConnection = Yii::$app->db;
        $intUpdate = $objConnection->createCommand()
            ->update('customers', $arrInputs, $arrWhere)
            ->execute();