no1exam/frontend/modules/customer/models/Tokens.php

    public static function create($arrInputs)
    {
        $intInsert = Yii::$app->db->createCommand()
            ->batchInsert('tokens', [
            'category_type',
            'customer_id',
            'token',
            'created_date'
        ], $arrInputs)
            ->execute();
---
INSERT INTO `tokens` (`category_type`, `customer_id`, `token`, `created_date`) VALUES ('forgotpassword', '7', '527747', '2018-05-21 22:13:09')

    public static function getTokens($arrInputs = [])
    {
        $objQuery = new Query();
        $objQuery->select([
            'id',
            'category_type',
            'customer_id',
            'token'
        ]);
        $objQuery->from('tokens as t');
        // Customer Id
        if (isset($arrInputs['customer_id']) && ! empty($arrInputs['customer_id'])) {
            $objQuery = $objQuery->andWhere('t.customer_id=:customerId', [
                ':customerId' => $arrInputs['customer_id']
            ]);
        }
        // Token
        if (isset($arrInputs['token']) && ! empty($arrInputs['token'])) {
            $objQuery = $objQuery->andWhere('t.token=:Token', [
                ':Token' => $arrInputs['token']
            ]);
        }
        $arrResponse = $objQuery->all();
---
SELECT `id`, `category_type`, `customer_id`, `token` FROM `tokens` `t` WHERE (t.customer_id='7') AND (t.token='527747')